//============================================================================
// Name        : main.cpp
// Author      : 徐子川
// Version     : 1.0.0
//============================================================================
#include "mainfunction.h"

fstream fs;
using namespace std;

int main() {
    //检查有没有这个文档，没有就创建
    fs.open(INPUT);
    fs.close();
    ofs.open(INPUT);
    Graph g;
    while(true){
        system("cls");
        initGraph(&g);
        read(&g);
        cout<<"┌────────────────────────────────────────────────────────────────┐"<<endl;
        cout<<"│★★★★★★★★★★欢迎来到武汉地铁查询系统★★★★★★★★★★│"<<endl;
        cout<<"├────────────────────────────────────────────────────────────────┤"<<endl;
        cout<<"├───────────────────1.查询具体线路的每一站点─────────────────────┤"<<endl;
        cout<<"├─★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★─┤"<<endl;
        cout<<"├───────────────────2.对某一线路站点依此浏览─────────────────────┤"<<endl;
        cout<<"├─★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★─┤"<<endl;
        cout<<"├───────────────────3.查询某一站的列车时刻表─────────────────────┤"<<endl;
        cout<<"├─★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★─┤"<<endl;
        cout<<"├───────────────────4.查询两站点间的推荐线路─────────────────────┤"<<endl;
        cout<<"├─★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★─┤"<<endl;
        cout<<"├───────────────────0.退出武汉地铁的查询系统─────────────────────┤"<<endl;
        cout<<"└────────────────────────────────────────────────────────────────┘"<<endl;
        int op;
        while(true){
            cout<<"请输入您的选项：";
            cin>>op;
            ofs<<op<<endl;
            if(op != 0 && op != 1 && op != 2 && op != 3 && op != 4){
                cout<<"输入选项有误！请重新输入。"<<endl;
            }else{
                break;
            }
        }
        if(op == 0){
            cout<<"欢迎下次使用！"<<endl;
            break;
        }
        switch(op){
            case 1:
                print(g);
                break;
            case 2:
                nextOrChange(g);
                break;
            case 3:
                matchTime(g);
                break;
            case 4:
                navigation(g);
        }
        system("pause");
    }
    cout<<endl;
    ofs.close();
    system("python encode.py");
    system("pause");
    return 0;
}


